import React from "react"
import { cn } from "@/lib/utils"
import ServiceCard from "@/components/shared/service-card"

type Props = {
  className?: string
}

export default async function ServiceCardList({ className }: Props) {
  const services = [
    {
      id: "1",
      icon: "/assets/service-icons/file.png",
      title: "Бухгалтерский учет",
      description:
        "Мы берем на себя все аспекты ведения бухгалтерского учета, чтобы вы могли сосредоточиться на вашем бизнесе. В наши услуги входят:",
      bullets: [
        {
          id: "1",
          point: "Ведение первичной документации",
        },
        {
          id: "2",
          point: "Расчет заработной платы",
        },
        {
          id: "3",
          point: "Учет доходов и расходов",
        },
        {
          id: "4",
          point: "Подготовка бухгалтерской отчетности",
        },
        {
          id: "5",
          point: "Ведение первичной документации",
        },
        {
          id: "6",
          point: "Расчет заработной платы",
        },
        {
          id: "7",
          point: "Учет доходов и расходов",
        },
        {
          id: "8",
          point: "Подготовка бухгалтерской отчетности",
        },
      ],
      price: 10000,
    },
    {
      id: "2",
      icon: "/assets/service-icons/scale.png",
      title: "Бухгалтерский учет",
      description:
        "Мы берем на себя все аспекты ведения бухгалтерского учета, чтобы вы могли сосредоточиться на вашем бизнесе. В наши услуги входят:",
      bullets: [
        {
          id: "1",
          point: "Ведение первичной документации",
        },
        {
          id: "2",
          point: "Расчет заработной платы",
        },
        {
          id: "3",
          point: "Учет доходов и расходов",
        },
        {
          id: "4",
          point: "Подготовка бухгалтерской отчетности",
        },
        {
          id: "5",
          point: "Ведение первичной документации",
        },
        {
          id: "6",
          point: "Расчет заработной платы",
        },
        {
          id: "7",
          point: "Учет доходов и расходов",
        },
        {
          id: "8",
          point: "Подготовка бухгалтерской отчетности",
        },
      ],
      price: 10000,
    },
    {
      id: "3",
      icon: "/assets/service-icons/accounting.png",
      title: "Бухгалтерский учет",
      description:
        "Мы берем на себя все аспекты ведения бухгалтерского учета, чтобы вы могли сосредоточиться на вашем бизнесе. В наши услуги входят:",
      bullets: [
        {
          id: "1",
          point: "Ведение первичной документации",
        },
        {
          id: "2",
          point: "Расчет заработной платы",
        },
        {
          id: "3",
          point: "Учет доходов и расходов",
        },
        {
          id: "4",
          point: "Подготовка бухгалтерской отчетности",
        },
        {
          id: "5",
          point: "Ведение первичной документации",
        },
        {
          id: "6",
          point: "Расчет заработной платы",
        },
        {
          id: "7",
          point: "Учет доходов и расходов",
        },
        {
          id: "8",
          point: "Подготовка бухгалтерской отчетности",
        },
      ],
      price: 10000,
    },
    {
      id: "4",
      icon: "/assets/service-icons/taxes.png",
      title: "Бухгалтерский учет",
      description:
        "Мы берем на себя все аспекты ведения бухгалтерского учета, чтобы вы могли сосредоточиться на вашем бизнесе. В наши услуги входят:",
      bullets: [
        {
          id: "1",
          point: "Ведение первичной документации",
        },
        {
          id: "2",
          point: "Расчет заработной платы",
        },
        {
          id: "3",
          point: "Учет доходов и расходов",
        },
        {
          id: "4",
          point: "Подготовка бухгалтерской отчетности",
        },
        {
          id: "5",
          point: "Ведение первичной документации",
        },
        {
          id: "6",
          point: "Расчет заработной платы",
        },
        {
          id: "7",
          point: "Учет доходов и расходов",
        },
        {
          id: "8",
          point: "Подготовка бухгалтерской отчетности",
        },
      ],
      price: 10000,
    },
    {
      id: "5",
      icon: "/assets/service-icons/graph.png",
      title: "Восстановление бухгалтерского учета",
      description:
        "Если у вас возникли проблемы с бухгалтерским учетом, мы поможем вам их решить. Восстановим учет за любой период, исправим ошибки и приведем документацию в порядок.",
      bullets: [],
      price: 10000,
    },
    {
      id: "6",
      icon: "/assets/service-icons/report.png",
      title: "Восстановление бухгалтерского учета",
      description:
        "Если у вас возникли проблемы с бухгалтерским учетом, мы поможем вам их решить. Восстановим учет за любой период, исправим ошибки и приведем документацию в порядок.",
      bullets: [],
      price: 10000,
    },
  ]
  return (
    <div className={cn("grid gap-5 md:grid-cols-2 xl:grid-cols-3", className)}>
      {services.map((service, index) => (
        <ServiceCard key={index} {...service} index={index} />
      ))}
    </div>
  )
}
